# Module 4 - Data Manipulation pt. 2

In [2]:
# import data analysis libraries #

import pandas as pd
import numpy as np

## String Manipulation 

Find more documentation here: 
* https://www.tutorialspoint.com/python_pandas/python_pandas_working_with_text_data.htm
* https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html

### Let's work with the Titanic dataset this week! 

    * pclass = passenger class; 1 = first class, 2 = second class, 3 = third class
    * survived = passenger survival; 1 = survived, 0 = did not survive
    * name = passenger name
    * sex = sex of passenger
    * age = age of passenger
    * sibsp = # of siblings / spouses aboard the Titanic
    * parch = # of parents / children aboard the Titanic
    * ticket = ticket number
    * fare = fare paid by passenger
    * cabin = passenger cabin
    * embarked = port of embarkation; C = Cherbourg, Q = Queenstown, S = Southampton
    * boat = lifeboat assignment 
    * body = recovered body number
    * home dest = anticipated home destination

In [4]:
# import the titanic dataset #

df = pd.read_excel("titanic.xls")
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [5]:
# create a smaller dataset with just the variables of interest #

df = df[["name", "cabin", "home.dest"]]
df.head()

,name,cabin,home.dest
0,"Allen, Miss. Elisabeth Walton",B5,"St Louis, MO"
1,"Allison, Master. Hudson Trevor",C22 C26,"Montreal, PQ / Chesterville, ON"
2,"Allison, Miss. Helen Loraine",C22 C26,"Montreal, PQ / Chesterville, ON"
3,"Allison, Mr. Hudson Joshua Creighton",C22 C26,"Montreal, PQ / Chesterville, ON"
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",C22 C26,"Montreal, PQ / Chesterville, ON"

In [6]:
# explore the characteristics of the data #

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 3 columns):
name         1309 non-null object
cabin        295 non-null object
home.dest    745 non-null object
dtypes: object(3)
memory usage: 30.8+ KB

## STRING FREQS AND UNIQUE VALUES

In [7]:
#### Unique string values

df.nunique()

name         1307
cabin         186
home.dest     369
dtype: int64

In [8]:
#### String Frequencies

df["home.dest"].value_counts()

New York, NY                      64
London                            14
Montreal, PQ                      10
Paris, France                      9
Cornwall / Akron, OH               9
                                  ..
Lake Arthur, Chavez County, NM     1
Stockholm, Sweden New York         1
Sydney, Australia                  1
Janjgir, India / Pennsylvania      1
Bergen, Norway                     1
Name: home.dest, Length: 369, dtype: int64

In [9]:
df["cabin"].value_counts()

C23 C25 C27        6
G6                 5
B57 B59 B63 B66    5
F2                 4
C22 C26            4
                  ..
B82 B84            1
C95                1
C53                1
A23                1
C49                1
Name: cabin, Length: 186, dtype: int64

In [10]:
df["name"].value_counts()

Connolly, Miss. Kate                          2
Kelly, Mr. James                              2
Sandstrom, Miss. Marguerite Rut               1
Leitch, Miss. Jessie Wills                    1
Murdlin, Mr. Joseph                           1
                                             ..
Strom, Mrs. Wilhelm (Elna Matilda Persson)    1
Cacic, Miss. Marija                           1
Dodge, Master. Washington                     1
Allum, Mr. Owen George                        1
Fleming, Miss. Margaret                       1
Name: name, Length: 1307, dtype: int64

## WORKING WITH TEXT DATA

In [11]:
df["name"].head()

0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
Name: name, dtype: object

### Length of a text string

In [12]:
#### length of a string
# how many characters are in the first passenger name?

len(df["name"][0])

29

### Starting & ending with specific characters or strings

In [13]:
#### does my string start with a specific character?
# how many passengers have the last name "Allison"?
# last name comes first in the name column 

df["name"].str.startswith("Allison").sum()

4

In [14]:
# which passengers have the last name "Allison"?

df.loc[df["name"].str.startswith("Allison")]

,name,cabin,home.dest
1,"Allison, Master. Hudson Trevor",C22 C26,"Montreal, PQ / Chesterville, ON"
2,"Allison, Miss. Helen Loraine",C22 C26,"Montreal, PQ / Chesterville, ON"
3,"Allison, Mr. Hudson Joshua Creighton",C22 C26,"Montreal, PQ / Chesterville, ON"
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",C22 C26,"Montreal, PQ / Chesterville, ON"

In [17]:
#### does my string end with a specific character?
# how many passengers have the first name "Ellen"?

df["name"].str.endswith("Ellen")#.sum()

0       False
1       False
2       False
3       False
4       False
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Name: name, Length: 1309, dtype: bool

In [16]:
# which passengers have the first name "Ellen"?

df.loc[df["name"].str.endswith("Ellen")]

                    name cabin         home.dest
24     Bird, Miss. Ellen   C97               NaN
570  Toomey, Miss. Ellen   NaN  Indianapolis, IN

### Locating specific characters or strings

In [18]:
#### locating words or symbols in dataset

df["name"].str.contains("Sara")#.sum()

0       False
1       False
2       False
3       False
4       False
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Name: name, Length: 1309, dtype: bool

In [19]:
df.loc[df["name"].str.contains("Sara")]

,name,cabin,home.dest
76,"Compton, Miss. Sara Rebecca",E49,"Lakewood, NJ"
88,"Daniels, Miss. Sarah",NaN,NaN
369,"Chapman, Mrs. John Henry (Sara Elizabeth Lawry)",NaN,"Cornwall / Spokane, WA"
1159,"Roth, Miss. Sarah A",NaN,NaN

### Changing text case - uppercase, lowercase, titlecase

In [24]:
#### changing string case
# changing the text to all uppercase

df["UP_name"] = df["name"].str.upper()
df.head()

,name,cabin,home.dest,UP_name,LOW_name
0,"Allen, Miss. Elisabeth Walton",B5,"St Louis, MO","ALLEN, MISS. ELISABETH WALTON","allen, miss. elisabeth walton"
1,"Allison, Master. Hudson Trevor",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MASTER. HUDSON TREVOR","allison, master. hudson trevor"
2,"Allison, Miss. Helen Loraine",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MISS. HELEN LORAINE","allison, miss. helen loraine"
3,"Allison, Mr. Hudson Joshua Creighton",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MR. HUDSON JOSHUA CREIGHTON","allison, mr. hudson joshua creighton"
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MRS. HUDSON J C (BESSIE WALDO DANIELS)","allison, mrs. hudson j c (bessie waldo daniels)"

In [23]:
#### changing string case
# changing the text to all lowercase

df["LOW_name"] = df["name"].str.lower()

df.head()

,name,cabin,home.dest,UP_name,LOW_name
0,"Allen, Miss. Elisabeth Walton",B5,"St Louis, MO","ALLEN, MISS. ELISABETH WALTON","allen, miss. elisabeth walton"
1,"Allison, Master. Hudson Trevor",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MASTER. HUDSON TREVOR","allison, master. hudson trevor"
2,"Allison, Miss. Helen Loraine",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MISS. HELEN LORAINE","allison, miss. helen loraine"
3,"Allison, Mr. Hudson Joshua Creighton",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MR. HUDSON JOSHUA CREIGHTON","allison, mr. hudson joshua creighton"
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MRS. HUDSON J C (BESSIE WALDO DANIELS)","allison, mrs. hudson j c (bessie waldo daniels)"

In [25]:
#### changing string case
# changing the text to title case (first letter capitalization)

df["TITLE_name"] = df["name"].str.title()

df.head()

,name,cabin,home.dest,UP_name,LOW_name,TITLE_name
0,"Allen, Miss. Elisabeth Walton",B5,"St Louis, MO","ALLEN, MISS. ELISABETH WALTON","allen, miss. elisabeth walton","Allen, Miss. Elisabeth Walton"
1,"Allison, Master. Hudson Trevor",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MASTER. HUDSON TREVOR","allison, master. hudson trevor","Allison, Master. Hudson Trevor"
2,"Allison, Miss. Helen Loraine",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MISS. HELEN LORAINE","allison, miss. helen loraine","Allison, Miss. Helen Loraine"
3,"Allison, Mr. Hudson Joshua Creighton",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MR. HUDSON JOSHUA CREIGHTON","allison, mr. hudson joshua creighton","Allison, Mr. Hudson Joshua Creighton"
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MRS. HUDSON J C (BESSIE WALDO DANIELS)","allison, mrs. hudson j c (bessie waldo daniels)","Allison, Mrs. Hudson J C (Bessie Waldo Daniels)"

### Remove white space from text

In [26]:
extra = "   _These words are surrounded by too much space_     "
extra

'   _These words are surrounded by too much space_     '

In [27]:
#### remove white space from the right-hand side of the text

extra.rstrip()

'   _These words are surrounded by too much space_'

In [28]:
#### remove white space from the left-hand side of the text

extra.lstrip()

'_These words are surrounded by too much space_     '

In [29]:
#### remove white space from both sides of the text

extra.strip()

'_These words are surrounded by too much space_'

In [30]:
df["name_s"] = df["name"].str.strip()

df.head()

,name,cabin,home.dest,UP_name,LOW_name,TITLE_name,name_s
0,"Allen, Miss. Elisabeth Walton",B5,"St Louis, MO","ALLEN, MISS. ELISABETH WALTON","allen, miss. elisabeth walton","Allen, Miss. Elisabeth Walton","Allen, Miss. Elisabeth Walton"
1,"Allison, Master. Hudson Trevor",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MASTER. HUDSON TREVOR","allison, master. hudson trevor","Allison, Master. Hudson Trevor","Allison, Master. Hudson Trevor"
2,"Allison, Miss. Helen Loraine",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MISS. HELEN LORAINE","allison, miss. helen loraine","Allison, Miss. Helen Loraine","Allison, Miss. Helen Loraine"
3,"Allison, Mr. Hudson Joshua Creighton",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MR. HUDSON JOSHUA CREIGHTON","allison, mr. hudson joshua creighton","Allison, Mr. Hudson Joshua Creighton","Allison, Mr. Hudson Joshua Creighton"
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",C22 C26,"Montreal, PQ / Chesterville, ON","ALLISON, MRS. HUDSON J C (BESSIE WALDO DANIELS)","allison, mrs. hudson j c (bessie waldo daniels)","Allison, Mrs. Hudson J C (Bessie Waldo Daniels)","Allison, Mrs. Hudson J C (Bessie Waldo Daniels)"

### Splitting Strings

In [31]:
df = df[["name", "cabin", "home.dest"]]

df.head(2)

                             name    cabin                        home.dest
0   Allen, Miss. Elisabeth Walton       B5                     St Louis, MO
1  Allison, Master. Hudson Trevor  C22 C26  Montreal, PQ / Chesterville, ON

In [32]:
### split the string of text after each white space

df["name"].str.split(" ")

0                      [Allen,, Miss., Elisabeth, Walton]
1                     [Allison,, Master., Hudson, Trevor]
2                       [Allison,, Miss., Helen, Loraine]
3              [Allison,, Mr., Hudson, Joshua, Creighton]
4       [Allison,, Mrs., Hudson, J, C, (Bessie, Waldo,...
                              ...
1304                             [Zabour,, Miss., Hileni]
1305                            [Zabour,, Miss., Thamine]
1306                        [Zakarian,, Mr., Mapriededer]
1307                              [Zakarian,, Mr., Ortin]
1308                               [Zimmerman,, Mr., Leo]
Name: name, Length: 1309, dtype: object

In [33]:
### split the string of text after only the first white space (n = 1)

df["name"].str.split(" ", n = 1)

0                        [Allen,, Miss. Elisabeth Walton]
1                       [Allison,, Master. Hudson Trevor]
2                         [Allison,, Miss. Helen Loraine]
3                 [Allison,, Mr. Hudson Joshua Creighton]
4       [Allison,, Mrs. Hudson J C (Bessie Waldo Danie...
                              ...
1304                              [Zabour,, Miss. Hileni]
1305                             [Zabour,, Miss. Thamine]
1306                         [Zakarian,, Mr. Mapriededer]
1307                               [Zakarian,, Mr. Ortin]
1308                                [Zimmerman,, Mr. Leo]
Name: name, Length: 1309, dtype: object

In [34]:
### split the string after the first white space, expand the seperated text to a new column 

df["name"].str.split(" ", n = 1, expand = True)

               0                                       1
0         Allen,                  Miss. Elisabeth Walton
1       Allison,                   Master. Hudson Trevor
2       Allison,                     Miss. Helen Loraine
3       Allison,             Mr. Hudson Joshua Creighton
4       Allison,  Mrs. Hudson J C (Bessie Waldo Daniels)
...          ...                                     ...
1304     Zabour,                            Miss. Hileni
1305     Zabour,                           Miss. Thamine
1306   Zakarian,                         Mr. Mapriededer
1307   Zakarian,                               Mr. Ortin
1308  Zimmerman,                                 Mr. Leo

[1309 rows x 2 columns]

In [36]:
### before splitting the text, you can replace certain characters with blank spaces
### replace special characters to make splitting easier

df["name"] = df["name"].str.replace(",", " ")

In [37]:
## split the string after the first white space, expand the seperated text to a new column 

df["name"].str.split(" ", n = 1, expand = True)

              0                                        1
0         Allen                   Miss. Elisabeth Walton
1       Allison                    Master. Hudson Trevor
2       Allison                      Miss. Helen Loraine
3       Allison              Mr. Hudson Joshua Creighton
4       Allison   Mrs. Hudson J C (Bessie Waldo Daniels)
...         ...                                      ...
1304     Zabour                             Miss. Hileni
1305     Zabour                            Miss. Thamine
1306   Zakarian                          Mr. Mapriededer
1307   Zakarian                                Mr. Ortin
1308  Zimmerman                                  Mr. Leo

[1309 rows x 2 columns]

In [38]:
#### adding the split columns onto your original dataset
# create a new dataset to capture the columns you plan to split (df2)

df2 = df['name'].str.split(" ", n = 1, expand = True)

df2.head()

         0                                        1
0    Allen                   Miss. Elisabeth Walton
1  Allison                    Master. Hudson Trevor
2  Allison                      Miss. Helen Loraine
3  Allison              Mr. Hudson Joshua Creighton
4  Allison   Mrs. Hudson J C (Bessie Waldo Daniels)

In [39]:
#### create new columns (or overwrite existing columns) to include new columns to original dataset
# when specifying the column you want to include, set it equal to the column index position

df["last name only"] = df2[0]

df.head()

,name,cabin,home.dest,last name only
0,Allen Miss. Elisabeth Walton,B5,"St Louis, MO",Allen
1,Allison Master. Hudson Trevor,C22 C26,"Montreal, PQ / Chesterville, ON",Allison
2,Allison Miss. Helen Loraine,C22 C26,"Montreal, PQ / Chesterville, ON",Allison
3,Allison Mr. Hudson Joshua Creighton,C22 C26,"Montreal, PQ / Chesterville, ON",Allison
4,Allison Mrs. Hudson J C (Bessie Waldo Daniels),C22 C26,"Montreal, PQ / Chesterville, ON",Allison

## Calculating & Removing Outliers

An outlier is a data point that differs significantly from other observations. The value of an outlier is relative to the dataset as a whole (i.e. 100-years old may be an outlier for a dataset for children, but not for the elderly).

In [41]:
df = pd.read_csv("gradedata2.csv")
print(df.shape)
df.head()

(2000, 8)

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"7379 Highland Rd. , Dublin, GA 31021"
1,Kadeem,Morrison,male,18,4,4,78.2,"8 Bayport St. , Honolulu, HI 96815"
2,Nash,Powell,male,18,5,9,79.3,"Encino, CA 91316, 3 Lilac Street"
3,Noelani,Wagner,female,14,2,7,83.2,"Riverview, FL 33569, 9998 North Smith Dr."
4,Noelani,Cherry,female,18,4,15,87.4,"97 SE. Ocean Street , Bethlehem, PA 18015"

### STANDARD DEVIATION

How much does the data vary from the average? SD is a measure of <b>spread</b>, how spread out a set of data is. 

* A <b>low</b> SD means the data is closely clustered around the mean. 
* A <b>high</b> SD means the data is spread out over a wider range of values. 

SD is typically used to determine if a specific data point is "standard and expected" or "unusual and unexpected". A data points distance to the mean can be measured by the number of SD's it is above or below the mean... 

When thinking about outliers, we can set a predetermined cut-off point for what distance from the mean you deem unacceptable. There are a few commonly used cut-off points. A common cut off point is +/- 1.96 SD's from the mean (95% of values will be within +/- 1.96 SD's from the mean)

#### 68 - 95 - 99.7 RULE

When your data is normally distributed (bell curve), typically your data will fall within the following patterns: 

* 68% of the data falls within one SD of the mean

* 95% of the data falls within 2 SD's of the mean

* 99.7% of the data falls within 3 SD's of the mean


![alt text](SD Bell Curve.jpeg "Standard Deviation")


#### Example:

The average weight of an American man is 175 lbs with a SD of 10 lbs. This means... 

* 68% of American men are between 165 and 185 lbs. 
* 95% of American men are between 155 and 195 lbs. 
* 99.7% of American men are between 145 and 205 lbs. 


### REMOVING OUTLIERS USING SD

* Determine a cut-off point 
* Calculate mean, std, and the cut-off values
* Drop all values that fall outside of this range

In [42]:
#Standard Deviation Method

meangrade = df['grade'].mean() # what is the mean grade for the class?

stdgrade = df['grade'].std() # what is the standard deviation of class grades?

toprange = meangrade + (stdgrade * 1.96) # the top limit for grade, anything above this is considered an outlier
botrange = meangrade - (stdgrade * 1.96) # the bottom limit for grade, anything below this is considered an outlier

df2 = df #create a new dataset that won't mess up the original 

df2 = df2.drop(df2[df2['grade'] > toprange].index) # drop all values greater than the top limit
df2 = df2.drop(df2[df2['grade'] < botrange].index) # drop all values less than the bottom limit

print(df2.shape) #54 outliers dropped

(1946, 8)

### INTERQUARTILE RANGE 

The Interquartile Range (IQR) is a measure of where the bulk of the data values lie. The IQR is the difference between the upper and lower quartiles in a data set. 

* <b>Quartiles:</b> the values that divide a list of numbers into quarters. 

* <b>Median:</b> the "middle" value in the list of numbers

* <b>Percentile:</b> the value below which a given percentage of observations exists. For example, the 20th percentile is the value below which 20% of the observations are found; above which 80% of the observations can be found. 

In a given set of numbers, there are three values that divide the data into four sections. 

![alt text](IQR.png "IQR")


#### Q1: Lower Quartile (25th percentile)
The median of the lower half of the data


#### Q2: Median (50th percentile)
The median of the full set of data


#### Q3: Upper Quartile (75th percentile)
The median of the upper half of the data


#### IQR
Represents the middle 50% of the data and is calculated by the following formula: 

### IQR = Q3 - Q1 


#### 1.5 RULE

A commonly used rules of thumb says that a data point is an outlier if it is . . . 

* ... below Q1 - (1.5 x IQR)

* ... above Q3 + (1.5 x IQR)


#### Example:

In a list of student absences {1, 3, 4, 6, 7, 7, 8, 8, 10, 12, 17}

* Q1 = 4
* Q2 = 7
* Q3 = 10

Q3(10) - Q1(4) = IQR = 6

lower limit : 4 - 1.5(6) = <b>-5</b>

upper limit : 10 + 1.5(6) = <b>19</b>

Data values less than or greater than these cut-off points are considered outliers. There are no outliers in this example.  


### REMOVING OUTLIERS USING IQR

* Calculate quartiles
* Calculate IQR
* Determine upper and lower limits
* Drop values less than the lower and/or greater than the upper

In [43]:
#Interquartile Range Method

q1 = df['grade'].quantile(.25) #calculate Q1
q3 = df['grade'].quantile(.75) #calculate Q3

iqr = q3-q1 # calcualate the IQR

toprange = q3 + iqr * 1.5 # determine the upper limit, values higher then this are outliers 
botrange = q1 - iqr * 1.5 # determine the lower limit, values lower than this are outliers

df3 = df

df3 = df3.drop(df3[df3['grade'] > toprange].index) #drop grades higher than the top range
df3 = df3.drop(df3[df3['grade'] < botrange].index) #drop grades lower than the bottom range

print(df3.shape) #2 outliers dropped

(1998, 8)